// 제이쿼리 기본 JS - main.js 

///////////////// 제이쿼리 로드구역 ///////////////////
$(() => { ///////////// jQB ////////////////////////////
    console.log("제이쿼리구역 로딩완료!");

    /*********************************************** 
                1. 대상선정 변수할당
    ***********************************************/
    // 대상1 : 버튼들 - .btns>button
    let btns = $(".btns>button");
    //    console.log("버튼개수:",btns.length);

    // 대상2 : 미니언즈 - .mi
    let mi = $(".mi");

    // 대상3 : 빌딩각방 - .building li
    let bd = $(".building li");
    // console.log("방수:",bd.length);

    // 대상4 : 메시지박스 - .msg
    let msg = $(".msg");



}); ////////////////// jQB ///////////////////////////
//////////////////////////////////////////////////////