// 보그 PJ 회원가입 JS - member.js ///

$(()=>{ /////////// jQB ////////////////////////////

    console.log("회원가입 로딩완료!");

    /********************************************************** 
        입력요소에서 포커스가 빠질때 발생하는 이벤트는?
        ->>>> blur(블러!!!) : focus의 반대
        대상: input[type=text][id!=email2][class!=search],
              input[type=password]
        대상조건: type이 text인 input요소 중 
                아이디가 email2가 아니고 클래스가 search가 
                아닌 요소 + type이 password인 input요소
        _______________________________________________

        요소[속성][속성] -> 한요소에 여러속성조건 선택가능
        참고) != 속성 선택자는 제이쿼리전용이다!(CSS사용불가)

    **********************************************************/
   $(`input[type=text][id!=email2][class!=search],
   input[type=password]`)
   .blur(function(){

        // 방금 블러발생한 요소의 id는?
        let cid = $(this).attr("id");
        // cid 는 current id 즉, 현재 아이디
        // attr(속성명) -> 해당속성값을 읽어옴!

        // 블러발생요소의 입력값은?
        let cv = $(this).val();
        // cv는 current value 즉, 현재값
        // val() -> 선택요소의 입력값을 읽어옴!


        console.log("블러!",cid,"\n값:",cv);


   }); /////////////// blur ////////////////////////
   /////////////////////////////////////////////////
    
}); ///////////////// jQB //////////////////////////
////////////////////////////////////////////////////